export const actor = {
  name: 'Брэд',
  surname: 'Питт',
  age: 57,
  country: 'США',
  movies: [
    {
      title: 'Однажды в... Голливуде',
      genre: ['Драма', 'Комедия'],
      year: 2019,
      director: ['Квентин Тарантино'],
      oscarsAwardsWon: [
        {
          'Лучшая мужская роль второго плана': 'Брэд Питт',
        },
        'Лучшая работа художника-постановщика',
      ],
    },
    {
      title: 'Загадочная история Бенджамина Баттона',
      genre: ['Драма', 'Фэнтези'],
      year: 2008,
      director: ['Дэвид Финчер'],
      oscarsAwardsWon: ['Лучшие декорации', 'Лучшие визуальные эффекты', 'Лучший грим'],
    },
    {
      title: 'Бесславные ублюдки',
      genre: ['Боевик', 'Драма', 'Комедия', 'Военный'],
      year: 2009,
      director: ['Квентин Тарантино'],
      oscarsAwardsWon: [
        {
          'Лучшая мужская роль второго плана': 'Кристоф Вальц',
        },
      ],
    },
  ],
};

// export const actor = {
//   name: 'Джефф',
//   surname: 'Бриджес',
//   age: 71,
//   country: 'США',
//   movies: [
//     {
//       title: 'Большой Лебовски',
//       genre: ['Комедия', 'Криминал'],
//       year: 1998,
//       director: ['Джоэл Коэн', 'Итан Коэн'],
//       oscarsAwardsWon: [],
//     },
//     {
//       title: 'Планета Ка-Пэкс',
//       genre: ['Фантастика', 'Драма', 'Детектив'],
//       year: 2001,
//       director: ['Иэн Софтли'],
//       oscarsAwardsWon: [],
//     },
//   ],
// };

// export const actor = {
//   name: 'Кевин',
//   surname: 'Спейси',
//   age: 62,
//   country: 'США',
//   movies: [
//     {
//       title: 'Планета Ка-Пэкс',
//       genre: ['Фантастика', 'Драма', 'Детектив'],
//       year: 2001,
//       director: ['Иэн Софтли'],
//       oscarsAwardsWon: [],
//     },
//     {
//       title: 'Красота по-американски',
//       genre: ['Драма'],
//       year: 1999,
//       director: ['Сэм Мендес'],
//       oscarsAwardsWon: [
//         'Лучший фильм',
//         {
//           'Лучшая мужская роль': 'Кевин Спейси',
//         },
//         {
//           'Лучший режиссер': ['Сэм Мендес'],
//         },
//         'Лучший сценарий',
//         'Лучшая работа оператора',
//       ],
//     },
//   ],
// };

// export const actor = {
//   name: 'Эмма',
//   surname: 'Стоун',
//   age: 33,
//   country: 'США',
//   movies: [
//     {
//       title: 'Бёрдмэн',
//       genre: ['Драма', 'Комедия'],
//       year: 2014,
//       director: ['Алехандро Гонсалес Иньярриту'],
//       oscarsAwardsWon: [
//         'Лучший фильм',
//         {
//           'Лучший режиссер': ['Алехандро Гонсалес Иньярриту'],
//         },
//         'Лучший сценарий',
//         'Лучшая работа оператора',
//       ],
//     },
//     {
//       title: 'Ла-Ла Ленд',
//       genre: ['Мюзикл', 'Драма', 'Мелорама'],
//       year: 2016,
//       director: ['Дэмьен Шазелл'],
//       oscarsAwardsWon: [
//         {
//           'Лучшая женская роль': 'Эмма Стоун',
//         },
//         {
//           'Лучший режиссер': ['Дэмьен Шазелл'],
//         },
//         'Лучшая работа оператора',
//         {
//           'Лучшая песня': '«City of Stars»',
//         },
//         'Лучший саундтрек',
//         'Лучшая работа художника-постановщика',
//       ],
//     },
//     {
//       title: 'Фаворитка',
//       genre: ['Драма', 'Биография', 'История'],
//       year: 2018,
//       director: ['Йоргос Лантимос'],
//       oscarsAwardsWon: [
//         {
//           'Лучшая женская роль': 'Оливия Колман',
//         },
//       ],
//     },
//     {
//       title: 'Прислуга',
//       genre: ['Драма'],
//       year: 2011,
//       director: ['Тейт Тейлор'],
//       oscarsAwardsWon: [
//         {
//           'Лучшая женская роль второго плана': 'Октавия Спенсер',
//         },
//       ],
//     },
//   ],
// };
